app/controllers/carts_controller.rb

SELECT  "carts".* FROM "carts"  WHERE "carts"."user_id" = 1  ORDER BY "carts"."id" ASC LIMIT 1
SELECT "line_items".* FROM "line_items"  WHERE "line_items"."cart_id" = 1
---
  def index
    @cart = Cart.where(user_id: @user.id).recent.first
    @cart_items = LineItem.where(cart_id: @cart.id)

SELECT  "listings".* FROM "listings"  WHERE "listings"."id" = ? LIMIT 1  [["id", 2]]
---
  def add
    @listing = Listing.find(params[:id])

DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 6]]
---
  def clear
    if request.post?
      @cart.line_items.destroy_all

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
    def find_user
      @user = User.find(params[:id])