app/controllers/cart_controller.rb

  def add
    @listing = Listing.find(params[:id])
---
SELECT  "listings".* FROM "listings"  WHERE "listings"."id" = ? LIMIT 1  [["id", 0]]