app/controllers/orders_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
---
  def sales
    # @orders = Order.all.where(seller: current_user).recent
    @orders = LineItem.listing.user.all.where()