app/controllers/orders_controller.rb

  def sales
    @orders = Order.all.where(seller: current_user).recent
---
SELECT "orders".* FROM "orders"  WHERE "orders"."seller_id" = 2  ORDER BY created_at DESC

  def purchases
    @orders = Order.all.where(buyer: current_user).recent
---
SELECT "orders".* FROM "orders"  WHERE "orders"."buyer_id" = 1  ORDER BY created_at DESC

  def create
    # @order = Order.new(order_params)
    # @order = @current_cart.build_order(params[:order])

    # Using activemerchant
    @order = @current_cart.build_order(order_params)
    @order.ip = request.remote_ip
    # @seller = @listing.user

    # @order.listing_id = @listing.id
    # @order.buyer_id = current_user.id
    # @order.seller_id = @seller.id
    # @order.cart_id = current_user.cart.id
    # @order = Order.make_order(params[:token], current_user, current_cart, request.remote_ip)

    # respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("buyer_id", "cart_id", "created_at", "ip", "updated_at") VALUES (?, ?, ?, ?, ?)  [["buyer_id", 1], ["cart_id", 1], ["created_at", "2014-07-07 09:56:07.415930"], ["ip", 127], ["updated_at", "2014-07-07 09:56:07.415930"]]
UPDATE "carts" SET "purchased_at" = ?, "updated_at" = ? WHERE "carts"."id" = 13  [["purchased_at", "2014-07-15 01:55:03.026490"], ["updated_at", "2014-07-15 01:55:03.027209"]]
UPDATE "orders" SET "cart_id" = ?, "updated_at" = ? WHERE "orders"."id" = 1  [["cart_id", nil], ["updated_at", "2014-07-07 09:57:19.960809"]]

    def find_listing
      @listing = Listing.find(params[:listing_id]) # find listing id in url
---
SELECT  "listings".* FROM "listings"  WHERE "listings"."id" = ? LIMIT 1  [["id", 4]]